TomaszKozminski/STM32-ToF-Matrix-Display/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <string.h>
#include "LedMatrix.h"
#include "Canvas.h"
#include "ImageLibrary.h"

//t
#include "RangeSensor.h"        // Nasz interfejs
#include "VL53L7CX_Adapter.h"   // Nasz adapter
#include "ObjectTracker.h"

#include "stm32l4xx_hal.h"
#include "stm32l4xx_hal_uart.h"
#include <stdio.h>
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim8;
DMA_HandleTypeDef hdma_tim8_ch1;

UART_HandleTypeDef huart2;
DMA_HandleTypeDef hdma_usart2_tx;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */

BaseType_t xHigherPriorityTaskWoken = pdFALSE;

TaskHandle_t xTaskToNotify = NULL;


static uint16_t FPS = 0;
extern uint32_t const * frame_reg[14];


osThreadId loopTaskHandle;

volatile bool changeImage = true;
volatile int32_t imageIndex = 0;

//t
volatile uint8_t vl53l7cx_int = 0; // Interrupt flag for VL53L7CX
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM8_Init(void);
static void MX_I2C2_Init(void);
static void MX_USART2_UART_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */
void LoopTask(void const * argument);

//t
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin);
void Debug_PrintState(const TrackedObject *obj); // Deklaracja funkcji debugującej
int _write(int file, char *ptr, int len);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// us delay tim1
void delay_us (uint16_t us)
{
	__HAL_TIM_SET_COUNTER(&htim1,0);  // set the counter value a 0
	while (__HAL_TIM_GET_COUNTER(&htim1) < us);  // wait for the counter to reach the us input in the parameter
}
// tick delay for BCM tim2
void delay_ticks (uint32_t ticks)
{
	__HAL_TIM_SET_COUNTER(&htim2,0);  // set the counter value a 0
	while (__HAL_TIM_GET_COUNTER(&htim2) < ticks);  // wait for the counter to reach the tick input in the parameter
}
// DMA callback - transfer done
void DMA_CB(DMA_HandleTypeDef *hdma){
  GPIOC->BSRR = LAT_Pin;
  //__ISB
  GPIOC->BSRR = (LAT_Pin) << 16;

  // task notify
  vTaskNotifyGiveFromISR(xTaskToNotify,&xHigherPriorityTaskWoken );
  xTaskToNotify = NULL;
  portYIELD_FROM_ISR( xHigherPriorityTaskWoken);
}

// t 
// Przekierowanie printf na UART2
int _write(int file, char *ptr, int len) {
    HAL_UART_Transmit(&huart2, (uint8_t *)ptr, len, 100);
    return len;
}

void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
  if (GPIO_Pin == I2C_INT_Pin)
  {
    vl53l7cx_int = 1;
  }
  if (GPIO_Pin == BUTTON_Pin)
  {
    if (GPIO_Pin == BUTTON_Pin)
    {
        GPIO_PinState state = HAL_GPIO_ReadPin(BUTTON_GPIO_Port, BUTTON_Pin);

        if (state == GPIO_PIN_RESET)
        {
            imageIndex++;
            changeImage = true;
        }
    }
  }
}

// Funkcja rysująca "Radar" w terminalu ASCII
void Debug_PrintMatrix(const TrackedObject *obj, const RangeSensorFrame *frame) {
    // 1. Wyczyść ekran
    printf("\033[2J\033[H"); 

    printf("=== MAPA ODLEGLOSCI (8x8) ===\r\n");
    printf("     0    1    2    3    4    5    6    7\r\n");
    printf("   ----------------------------------------\r\n");

    // 2. Pętla rysująca siatkę 8x8
    for (int y = 0; y < 8; y++) {
        printf("%d | ", y); // Numer wiersza
        for (int x = 0; x < 8; x++) {
            // Obliczamy indeks w tablicy liniowej (zakładamy układ wierszami)
            // Czasami czujniki mają układ kolumnami - zobaczysz to machając ręką
            int idx = y * 8 + x; 
            
            uint16_t dist = frame->distances_mm[idx];
            uint8_t stat = frame->statuses[idx];

            // Status 5 i 9 to poprawne pomiary. 
            // Jeśli inny -> wyświetl kreski, żeby nie zaciemniać obrazu zerami.
            if (stat == 5 || stat == 9) {
                printf("%4d ", dist);
            } else {
                printf("---- "); 
            }
        }
        printf("|\r\n"); // Koniec wiersza
    }
    printf("   ----------------------------------------\r\n");

    // 3. Wyniki Trackera (pod spodem)
    printf("\r\n=== WYNIKI ALGORYTMU ===\r\n");
    printf("Status:      %s\r\n", obj->is_detected ? "[ OBIEKT WYKRYTY ]" : "[ Szukam... ]");
    printf("Pozycja X:   %5.2f  (Srodek to 3.5)\r\n", obj->position_x);
    printf("Pozycja Y:   %5.2f  (Srodek to 3.5)\r\n", obj->position_y);
    printf("Odleglosc:   %5.0f mm\r\n", obj->distance_mm);
    printf("Pewnosc:     %5.0f %%\r\n", obj->probability * 100.0f);
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

